<?
//หากมีการเรียกไฟล์นี้โดยตรง
if (eregi("config.in.php",$PHP_SELF)) {
    Header("Location: ../index.php");
    die();
}

$DAY_FULL_TEXT = array(
"Sunday" => "อาทิตย์",
"Monday" => "จันทร์",
"Tuesday" => "อังคาร",
"Wednesday" => "พุธ",
"Thursday" => "พฤหัสบดี",
"Friday" => "ศุกร์",
"Saturday" => "เสาร์"
);

$DAY_SHORT_TEXT = array(
"Sunday" => "อา.",
"Monday" => "จ.",
"Tuesday" => "อ.",
"Wednesday" => "พ.",
"Thursday" => "พฤ.",
"Friday" => "ศ.",
"Saturday" => "ส."
);

$SHORT_MONTH = array(
"1" => "ม.ค.",
"2" => "ก.พ.",
"3" => "มี.ค.",
"4" => "เม.ย.",
"5" => "พ.ค.",
"6" => "มิ.ย.",
"7" => "ก.ค.",
"8" => "ส.ค.",
"9" => "ก.ย.",
"10" => "ต.ค.",
"11" => "พ.ย.",
"12" => "ธ.ค."
);

$FULL_MONTH = array(
"1" => "มกราคม",
"2" => "กุมภาพันธ์",
"3" => "มีนาคม",
"4" => "เมษายน",
"5" => "พฤษภาคม",
"6" => "มิถุนายน",
"7" => "กรกฏาคม",
"8" => "สิงหาคม",
"9" => "กันยายน",
"10" => "ตุลาคม",
"11" => "พฤศจิกายน",
"12" => "ธันวาคม"
);

$FULL_MONTH2 = array(
"01" => "มกราคม",
"02" => "กุมภาพันธ์",
"03" => "มีนาคม",
"04" => "เมษายน",
"05" => "พฤษภาคม",
"06" => "มิถุนายน",
"07" => "กรกฏาคม",
"08" => "สิงหาคม",
"09" => "กันยายน",
"10" => "ตุลาคม",
"11" => "พฤศจิกายน",
"12" => "ธันวาคม"
);

?>